fio/results/fio-res_201904202200
Seq-Read-1m: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Seq-Write-1m: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
Rand-Read-4k-32qd: (g=2): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
Rand-Write-4k-32qd: (g=3): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.1
Starting 4 processes
3;fio-3.1;Seq-Read-1m;0;0;688128;68723;67;10013;51;467;72.182445;23.258539;2659;49918;14821.804201;4467.672667;1.000000%=2899;5.000000%=3162;10.000000%=3981;20.000000%=15269;30.000000%=16056;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16449;80.000000%=16449;90.000000%=17170;95.000000%=17694;99.000000%=19529;99.500000%=19791;99.900000%=50069;99.950000%=50069;99.990000%=50069;0%=0;0%=0;0%=0;2714;49987;14894.783095;4470.185442;47407;158024;78.554793%;53985.210526;25206.541626;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.119856%;0.489413%;673;0;288;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;10.12%;1.79%;87.65%;0.45%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36602;0;1;366094;365539;731809;98.24%
3;fio-3.1;Seq-Write-1m;1;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;688128;68723;67;10013;55;206;97.507057;22.914864;2943;21006;14796.591251;4095.033255;1.000000%=3194;5.000000%=3391;10.000000%=3751;20.000000%=16056;30.000000%=16187;40.000000%=16187;50.000000%=16318;60.000000%=16318;70.000000%=16318;80.000000%=16318;90.000000%=16449;95.000000%=16449;99.000000%=16580;99.500000%=16711;99.900000%=21102;99.950000%=21102;99.990000%=21102;0%=0;0%=0;0%=0;3036;21133;14894.879762;4100.367032;45176;153826;75.105630%;51614.842105;24762.795499;0.179784%;0.609269%;672;0;27;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;10.71%;0.89%;88.24%;0.15%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36602;0;1;366094;365539;731809;98.24%
3;fio-3.1;Rand-Read-4k-32qd;2;0;134744;13459;3364;10011;2;66;9.051350;3.281991;237;20191;9496.206562;2911.524323;1.000000%=493;5.000000%=716;10.000000%=7176;20.000000%=10027;30.000000%=10289;40.000000%=10289;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10682;95.000000%=11075;99.000000%=12648;99.500000%=13172;99.900000%=15007;99.950000%=16056;99.990000%=19267;0%=0;0%=0;0%=0;246;20200;9505.918782;2912.258452;8577;29426;71.945597%;9683.157895;4780.951373;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;2.447552%;4.905095%;31513;0;62;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;1.05%;4.59%;2.62%;1.01%;0.63%;7.01%;83.08%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36602;0;1;366094;365539;731809;98.24%
3;fio-3.1;Rand-Write-4k-32qd;3;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;125036;12489;3122;10011;2;76;10.239350;3.173427;662;20468;10233.427789;1139.059595;1.000000%=3981;5.000000%=10158;10.000000%=10289;20.000000%=10420;30.000000%=10420;40.000000%=10420;50.000000%=10420;60.000000%=10420;70.000000%=10420;80.000000%=10551;90.000000%=10551;95.000000%=10551;99.000000%=10682;99.500000%=11206;99.900000%=14876;99.950000%=16187;99.990000%=19529;0%=0;0%=0;0%=0;694;20480;10244.303854;1139.323630;12313;17303;100.000000%;12570.450000;1113.963832;4.035964%;3.026973%;30882;0;28;0.1%;0.1%;0.1%;0.1%;0.1%;99.9%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.04%;0.02%;0.01%;0.95%;3.78%;95.19%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;xvda;39062;36602;0;1;366094;365539;731809;98.24%

Seq-Read-1m: (groupid=0, jobs=1): err= 0: pid=20005: Sat Apr 20 22:00:43 2019
   read: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=51, max=467, avg=72.18, stdev=23.26
    clat (usec): min=2659, max=49918, avg=14821.80, stdev=4467.67
     lat (usec): min=2714, max=49987, avg=14894.78, stdev=4470.19
    clat percentiles (usec):
     |  1.00th=[ 2900],  5.00th=[ 3163], 10.00th=[ 3982], 20.00th=[15270],
     | 30.00th=[16057], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16450], 80.00th=[16450], 90.00th=[17171], 95.00th=[17695],
     | 99.00th=[19530], 99.50th=[19792], 99.90th=[50070], 99.95th=[50070],
     | 99.99th=[50070]
   bw (  KiB/s): min=47407, max=158024, per=78.55%, avg=53985.21, stdev=25206.54, samples=19
   iops        : min=   46, max=  154, avg=52.16, stdev=24.67, samples=19
  lat (msec)   : 4=10.12%, 10=1.79%, 20=87.65%, 50=0.45%
  cpu          : usr=0.12%, sys=0.49%, ctx=673, majf=0, minf=288
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=672,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Seq-Write-1m: (groupid=1, jobs=1): err= 0: pid=20006: Sat Apr 20 22:00:43 2019
  write: IOPS=67, BW=67.1MiB/s (70.4MB/s)(672MiB/10013msec)
    slat (usec): min=55, max=206, avg=97.51, stdev=22.91
    clat (usec): min=2943, max=21006, avg=14796.59, stdev=4095.03
     lat (usec): min=3036, max=21133, avg=14894.88, stdev=4100.37
    clat percentiles (usec):
     |  1.00th=[ 3195],  5.00th=[ 3392], 10.00th=[ 3752], 20.00th=[16057],
     | 30.00th=[16188], 40.00th=[16188], 50.00th=[16319], 60.00th=[16319],
     | 70.00th=[16319], 80.00th=[16319], 90.00th=[16450], 95.00th=[16450],
     | 99.00th=[16581], 99.50th=[16712], 99.90th=[21103], 99.95th=[21103],
     | 99.99th=[21103]
   bw (  KiB/s): min=45176, max=153826, per=75.11%, avg=51614.84, stdev=24762.80, samples=19
   iops        : min=   44, max=  150, avg=50.05, stdev=24.21, samples=19
  lat (msec)   : 4=10.71%, 10=0.89%, 20=88.24%, 50=0.15%
  cpu          : usr=0.18%, sys=0.61%, ctx=672, majf=0, minf=27
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,672,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
Rand-Read-4k-32qd: (groupid=2, jobs=1): err= 0: pid=20007: Sat Apr 20 22:00:43 2019
   read: IOPS=3364, BW=13.1MiB/s (13.8MB/s)(132MiB/10011msec)
    slat (nsec): min=2723, max=66388, avg=9051.35, stdev=3281.99
    clat (usec): min=237, max=20191, avg=9496.21, stdev=2911.52
     lat (usec): min=246, max=20200, avg=9505.92, stdev=2912.26
    clat percentiles (usec):
     |  1.00th=[  494],  5.00th=[  717], 10.00th=[ 7177], 20.00th=[10028],
     | 30.00th=[10290], 40.00th=[10290], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10683], 95.00th=[11076],
     | 99.00th=[12649], 99.50th=[13173], 99.90th=[15008], 99.95th=[16057],
     | 99.99th=[19268]
   bw (  KiB/s): min= 8577, max=29426, per=71.95%, avg=9683.16, stdev=4780.95, samples=19
   iops        : min= 2144, max= 7356, avg=2420.37, stdev=1195.22, samples=19
  lat (usec)   : 250=0.01%, 500=1.05%, 750=4.59%, 1000=2.62%
  lat (msec)   : 2=1.01%, 4=0.63%, 10=7.01%, 20=83.08%, 50=0.01%
  cpu          : usr=2.45%, sys=4.91%, ctx=31513, majf=0, minf=62
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=33686,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32
Rand-Write-4k-32qd: (groupid=3, jobs=1): err= 0: pid=20008: Sat Apr 20 22:00:43 2019
  write: IOPS=3122, BW=12.2MiB/s (12.8MB/s)(122MiB/10011msec)
    slat (nsec): min=2915, max=76748, avg=10239.35, stdev=3173.43
    clat (usec): min=662, max=20468, avg=10233.43, stdev=1139.06
     lat (usec): min=694, max=20480, avg=10244.30, stdev=1139.32
    clat percentiles (usec):
     |  1.00th=[ 3982],  5.00th=[10159], 10.00th=[10290], 20.00th=[10421],
     | 30.00th=[10421], 40.00th=[10421], 50.00th=[10421], 60.00th=[10421],
     | 70.00th=[10421], 80.00th=[10552], 90.00th=[10552], 95.00th=[10552],
     | 99.00th=[10683], 99.50th=[11207], 99.90th=[14877], 99.95th=[16188],
     | 99.99th=[19530]
   bw (  KiB/s): min=12313, max=17303, per=100.00%, avg=12570.45, stdev=1113.96, samples=20
   iops        : min= 3078, max= 4325, avg=3142.25, stdev=278.40, samples=20
  lat (usec)   : 750=0.04%, 1000=0.02%
  lat (msec)   : 2=0.01%, 4=0.95%, 10=3.78%, 20=95.19%, 50=0.01%
  cpu          : usr=4.04%, sys=3.03%, ctx=30882, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,31259,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 1 (all jobs):
  WRITE: bw=67.1MiB/s (70.4MB/s), 67.1MiB/s-67.1MiB/s (70.4MB/s-70.4MB/s), io=672MiB (705MB), run=10013-10013msec

Run status group 2 (all jobs):
   READ: bw=13.1MiB/s (13.8MB/s), 13.1MiB/s-13.1MiB/s (13.8MB/s-13.8MB/s), io=132MiB (138MB), run=10011-10011msec

Run status group 3 (all jobs):
  WRITE: bw=12.2MiB/s (12.8MB/s), 12.2MiB/s-12.2MiB/s (12.8MB/s-12.8MB/s), io=122MiB (128MB), run=10011-10011msec

Disk stats (read/write):
  xvda: ios=39062/36602, merge=0/1, ticks=366094/365539, in_queue=731809, util=98.24%